# es.org --- containing notes on embedded system

****** overview
Linux下的Minicom的功能与Windows下的超级终端功能相似，可以通过串口控制外部的硬件
设备.适于在linux通过超级终端对嵌入式设备行管理.同样也可以使用minicom对外置Modem
进行控制.

HOMEPAGE: https://alioth.debian.org/projects/minicom/

Minicom is a menu driven communications program. It emulates ANSI and
VT102 terminals. It has a dialing directory and auto zmodem download.

安装
1. apt
   #+BEGIN_SRC sh :results output
     apt-cache search minicom
   #+END_SRC

   #+RESULTS:
   : minicom - friendly menu driven serial communication program
   : cutecom - 图形界面的串口调试终端，类似于 minicom

2. 源码
   + 官网下载源码包
   + ./configure make make install
